# Grid Create(Document, Arc) Method

Source: https://www.revitapidocs.com/2026/2f1e2722-d302-eb69-818a-44e0e169140c.htm

---

| Grid Create(Document, Arc) Method |
| --- |

Creates a new radial grid line.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static Grid Create(
	Document document,
	Arc arc
)
```

```
Public Shared Function Create (
	document As Document,
	arc As Arc
) As Grid
```

```
public:
static Grid^ Create(
	Document^ document,
	Arc^ arc
)
```

```
static member Create :
        document : Document *
        arc : Arc -> Grid
```

#### Parameters

document Document
:   The document in which the new instance is created.

arc Arc
:   An arc object that represents the location of the new grid curve.

#### Return Value

Grid
The newly created grid. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document.  \-or\-  The input arc is not on a horizontal plane. |
| ArgumentNullException | A non\-optional argument was null |

Remarks The arc should be on a horizontal plane. See Also

#### Reference

Grid Class Create Overload Autodesk.Revit.DB Namespace